m5/ex-1/test_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <tns:get_movies xmlns:tns="http://cinema.example.com/soap" />
    </soap:Body>
</soap:Envelope>